0marAmez/EmbeddedSystemsPSoC/Project6/Lab6.2.cydsn/Generated_Source/PSoC6/BLE_config.c
/***************************************************************************//**
* \file CY_BLE.c
* \version 2.20
* 
* \brief
*  This file contains the source code of initialization of the config structure
*  for BLE.
* 
********************************************************************************
* \copyright
* Copyright 2017-2019, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "BLE_config.h"

#if (CY_BLE_HOST_CONTR_CORE)    
#include "flash/cy_flash.h"
#include "ble/cy_ble_event_handler.h"
#include "cyfitter_sysint_cfg.h"

#if (CY_BLE_MODE_PROFILE)
/***************************************
* Global Variables
***************************************/
/* Initializes the cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo  structure */
#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)

#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */

/* Initializes the cy_stc_ble_gapc_disc_info_t  cy_ble_discoveryInfo  structure */
#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
static cy_stc_ble_gapc_scan_params_t cy_ble_gapcScanConfig[0x01u] = {

    /* Central configuration 0 */
    {
        .fastScanInterval                   = 0x0030u, 
        .fastScanWindow                     = 0x0030u, 
        .fastScanTimeOut                    = 0x0000u, 
        .slowScanEnabled                    = 0x00u, 
        .slowScanInterval                   = 0x0800u, 
        .slowScanWindow                     = 0x0708u, 
        .slowScanTimeOut                    = 0x0096u, 
        .gapcConnectionIntervalMin          = 0x0006u, 
        .gapcConnectionIntervalMax          = 0x0028u, 
        .gapcConnectionSlaveLatency         = 0x0000u, 
        .gapcConnectionTimeOut              = 0x03E8u, 
    },
};


/* This array of type cy_stc_ble_gapc_disc_info_t is present only when  
   the BLE component is configured for Central or Observer GAP roles.  
   It contains the Scan settings entered in the customizer.  
   This variable can be used by advanced users to change Scan  
   settings in runtime.
*/
cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo[0x01u] = {
    {
        0x02u, /* discProcedure */ 
        0x01u, /* scanType */ 
        0x0030u, /* scanInterval */ 
        0x0030u, /* scanWindow */ 
        0x00u, /* ownAddrType */ 
        0x00u, /* scanFilterPolicy */ 
        0x0000u, /* scanTO */ 
        0x00u, /* filterDuplicates */ 
    },
};

#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

#if ((CY_BLE_MODE_PROFILE) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))

#if(CY_BLE_MODE_PROFILE)
    CY_SECTION(".cy_em_eeprom") CY_ALIGN(CY_FLASH_SIZEOF_ROW) static const cy_stc_ble_flash_storage_t cy_ble_flashStorage =
    {
        { 0x00u }, 
        {{
            0x00u, 0x00u, 
            0x00u /* CRC */
        },
        {
            0x00u, 0x00u, 
            0x00u /* CRC */
        }}, 
        0x02u, /* CY_BLE_GATT_DB_CCCD_COUNT */ 
        0x02u, 
    };
#endif /* (CY_BLE_MODE_PROFILE) */

#endif  /* (CY_BLE_MODE_PROFILE) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

#if (CY_BLE_GATT_ROLE_SERVER)
static const cy_stc_ble_gatts_t cy_ble_gatts =
{
    0x000Au,    /* Handle of the GATT service */
    0x000Cu,    /* Handle of the Service Changed characteristic */
    0x000Du,    /* Handle of the Client Characteristic Configuration descriptor */
};
static const cy_stc_ble_gaps_t cy_ble_gaps =
{
    0x0001u,    /* Handle of the GAP service */
    0x0003u,    /* Handle of the Device Name characteristic */
    0x0005u,    /* Handle of the Appearance characteristic */
    CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Peripheral Preferred Connection Parameters characteristic */
    0x0007u,    /* Handle of the Central Address Resolution characteristic */
    0x0009u,    /* Handle of the Resolvable Private Address Only characteristic */
};
static uint8_t cy_ble_attValues[0x8Bu] = {
    /* Device Name */
    (uint8_t)'P', (uint8_t)'6', (uint8_t)'C', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', (uint8_t)'r', (uint8_t)'a',
(uint8_t)'l', 

    /* Appearance */
    0x00u, 0x00u, 

    /* Central Address Resolution */
    0x00u, 

    /* Resolvable Private Address Only */
    0x00u, 

    /* Service Changed */
    0x00u, 0x00u, 0x00u, 0x00u, 

    /* Manufacturer Name String */
    (uint8_t)'C', (uint8_t)'y', (uint8_t)'p', (uint8_t)'r', (uint8_t)'e', (uint8_t)'s', (uint8_t)'s', (uint8_t)' ',
(uint8_t)'S', (uint8_t)'e', (uint8_t)'m', (uint8_t)'i', (uint8_t)'c', (uint8_t)'o', (uint8_t)'n', (uint8_t)'d',
(uint8_t)'u', (uint8_t)'c', (uint8_t)'t', (uint8_t)'o', (uint8_t)'r', (uint8_t)' ', (uint8_t)'C', (uint8_t)'o',
(uint8_t)'r', (uint8_t)'p', (uint8_t)'o', (uint8_t)'r', (uint8_t)'a', (uint8_t)'t', (uint8_t)'i', (uint8_t)'o',
(uint8_t)'n', 

    /* Model Number String */
    (uint8_t)'P', (uint8_t)'S', (uint8_t)'o', (uint8_t)'C', (uint8_t)' ', (uint8_t)'6', (uint8_t)' ', (uint8_t)'M',
(uint8_t)'C', (uint8_t)'U', (uint8_t)' ', (uint8_t)'w', (uint8_t)'i', (uint8_t)'t', (uint8_t)'h', (uint8_t)' ',
(uint8_t)'C', (uint8_t)'S', (uint8_t)'E', (uint8_t)'1', (uint8_t)'2', (uint8_t)'1', (uint8_t)' ', (uint8_t)'L',
(uint8_t)'a', (uint8_t)'b', (uint8_t)'4', (uint8_t)'.', (uint8_t)'3', 

    /* Serial Number String */
    

    /* Hardware Revision String */
    (uint8_t)'C', (uint8_t)'Y', (uint8_t)'8', (uint8_t)'C', (uint8_t)'K', (uint8_t)'I', (uint8_t)'T', (uint8_t)'-',
(uint8_t)'0', (uint8_t)'6', (uint8_t)'2', (uint8_t)'-', (uint8_t)'B', (uint8_t)'L', (uint8_t)'E', (uint8_t)' ',
(uint8_t)'P', (uint8_t)'S', (uint8_t)'o', (uint8_t)'C', (uint8_t)' ', (uint8_t)'6', (uint8_t)' ', (uint8_t)'B',
(uint8_t)'L', (uint8_t)'E', (uint8_t)' ', (uint8_t)'P', (uint8_t)'i', (uint8_t)'o', (uint8_t)'n', (uint8_t)'n',
(uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'K', (uint8_t)'i', (uint8_t)'t', 

    /* Firmware Revision String */
    (uint8_t)'v', (uint8_t)'1', (uint8_t)'.', (uint8_t)'2', (uint8_t)'0', 

    /* Software Revision String */
    

    /* System ID */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* IEEE 11073-20601 Regulatory Certification Data List */
    0x00u, 

    /* PnP ID */
    0x01u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* Distance */
    0x02u, 

};
#if(CY_BLE_GATT_DB_CCCD_COUNT != 0u)
static uint8_t cy_ble_attValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT];
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

static const uint8_t cy_ble_attUuid128[][16u] = {
    /* Proximity */
    { 0x54u, 0x98u, 0xAAu, 0xAFu, 0x0Du, 0xAAu, 0xA2u, 0x8Fu, 0xA2u, 0x4Cu, 0x89u, 0x04u, 0xE0u, 0xC4u, 0x38u, 0x14u },
    /* Distance */
    { 0x18u, 0x31u, 0xC6u, 0xA0u, 0x36u, 0x36u, 0x2Eu, 0x83u, 0xFBu, 0x4Du, 0xE5u, 0x87u, 0xAFu, 0x99u, 0x25u, 0xD7u },
};

static cy_stc_ble_gatts_att_gen_val_len_t cy_ble_attValuesLen[0x12u] = {
    { 0x0009u, (void *)&cy_ble_attValues[0] }, /* Device Name */
    { 0x0002u, (void *)&cy_ble_attValues[9] }, /* Appearance */
    { 0x0001u, (void *)&cy_ble_attValues[11] }, /* Central Address Resolution */
    { 0x0001u, (void *)&cy_ble_attValues[12] }, /* Resolvable Private Address Only */
    { 0x0004u, (void *)&cy_ble_attValues[13] }, /* Service Changed */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[0] }, /* Client Characteristic Configuration */
    { 0x0021u, (void *)&cy_ble_attValues[17] }, /* Manufacturer Name String */
    { 0x001Du, (void *)&cy_ble_attValues[50] }, /* Model Number String */
    { 0x0000u, (void *)&cy_ble_attValues[79] }, /* Serial Number String */
    { 0x0026u, (void *)&cy_ble_attValues[79] }, /* Hardware Revision String */
    { 0x0005u, (void *)&cy_ble_attValues[117] }, /* Firmware Revision String */
    { 0x0000u, (void *)&cy_ble_attValues[122] }, /* Software Revision String */
    { 0x0008u, (void *)&cy_ble_attValues[122] }, /* System ID */
    { 0x0001u, (void *)&cy_ble_attValues[130] }, /* IEEE 11073-20601 Regulatory Certification Data List */
    { 0x0007u, (void *)&cy_ble_attValues[131] }, /* PnP ID */
    { 0x0010u, (void *)&cy_ble_attUuid128[0] }, /* Proximity UUID */
    { 0x0010u, (void *)&cy_ble_attUuid128[1] }, /* Distance UUID */
    { 0x0001u, (void *)&cy_ble_attValues[138] }, /* Distance */
};

static const cy_stc_ble_gatts_db_t cy_ble_gattDB[0x23u] = {
    { 0x0001u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0009u, {{0x1800u, NULL}}                           },
    { 0x0002u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0003u, {{0x2A00u, NULL}}                           },
    { 0x0003u, 0x2A00u /* Device Name                         */, 0x01020001u /* rd    */, 0x0003u, {{0x0009u, (void *)&cy_ble_attValuesLen[0]}} },
    { 0x0004u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0005u, {{0x2A01u, NULL}}                           },
    { 0x0005u, 0x2A01u /* Appearance                          */, 0x01020001u /* rd    */, 0x0005u, {{0x0002u, (void *)&cy_ble_attValuesLen[1]}} },
    { 0x0006u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0007u, {{0x2AA6u, NULL}}                           },
    { 0x0007u, 0x2AA6u /* Central Address Resolution          */, 0x01020001u /* rd    */, 0x0007u, {{0x0001u, (void *)&cy_ble_attValuesLen[2]}} },
    { 0x0008u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0009u, {{0x2AC9u, NULL}}                           },
    { 0x0009u, 0x2AC9u /* Resolvable Private Address Only     */, 0x01020001u /* rd    */, 0x0009u, {{0x0001u, (void *)&cy_ble_attValuesLen[3]}} },
    { 0x000Au, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Du, {{0x1801u, NULL}}                           },
    { 0x000Bu, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x000Du, {{0x2A05u, NULL}}                           },
    { 0x000Cu, 0x2A05u /* Service Changed                     */, 0x01200000u /* ind   */, 0x000Du, {{0x0004u, (void *)&cy_ble_attValuesLen[4]}} },
    { 0x000Du, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x000Du, {{0x0002u, (void *)&cy_ble_attValuesLen[5]}} },
    { 0x000Eu, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0020u, {{0x180Au, NULL}}                           },
    { 0x000Fu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0010u, {{0x2A29u, NULL}}                           },
    { 0x0010u, 0x2A29u /* Manufacturer Name String            */, 0x01020001u /* rd    */, 0x0010u, {{0x0021u, (void *)&cy_ble_attValuesLen[6]}} },
    { 0x0011u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0012u, {{0x2A24u, NULL}}                           },
    { 0x0012u, 0x2A24u /* Model Number String                 */, 0x01020001u /* rd    */, 0x0012u, {{0x001Du, (void *)&cy_ble_attValuesLen[7]}} },
    { 0x0013u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0014u, {{0x2A25u, NULL}}                           },
    { 0x0014u, 0x2A25u /* Serial Number String                */, 0x01020001u /* rd    */, 0x0014u, {{0x0000u, (void *)&cy_ble_attValuesLen[8]}} },
    { 0x0015u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0016u, {{0x2A27u, NULL}}                           },
    { 0x0016u, 0x2A27u /* Hardware Revision String            */, 0x01020001u /* rd    */, 0x0016u, {{0x0026u, (void *)&cy_ble_attValuesLen[9]}} },
    { 0x0017u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0018u, {{0x2A26u, NULL}}                           },
    { 0x0018u, 0x2A26u /* Firmware Revision String            */, 0x01020001u /* rd    */, 0x0018u, {{0x0005u, (void *)&cy_ble_attValuesLen[10]}} },
    { 0x0019u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Au, {{0x2A28u, NULL}}                           },
    { 0x001Au, 0x2A28u /* Software Revision String            */, 0x01020001u /* rd    */, 0x001Au, {{0x0000u, (void *)&cy_ble_attValuesLen[11]}} },
    { 0x001Bu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Cu, {{0x2A23u, NULL}}                           },
    { 0x001Cu, 0x2A23u /* System ID                           */, 0x01020001u /* rd    */, 0x001Cu, {{0x0008u, (void *)&cy_ble_attValuesLen[12]}} },
    { 0x001Du, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Eu, {{0x2A2Au, NULL}}                           },
    { 0x001Eu, 0x2A2Au /* IEEE 11073-20601 Regulatory Certifi */, 0x01020001u /* rd    */, 0x001Eu, {{0x0001u, (void *)&cy_ble_attValuesLen[13]}} },
    { 0x001Fu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0020u, {{0x2A50u, NULL}}                           },
    { 0x0020u, 0x2A50u /* PnP ID                              */, 0x01020001u /* rd    */, 0x0020u, {{0x0007u, (void *)&cy_ble_attValuesLen[14]}} },
    { 0x0021u, 0x2800u /* Primary service                     */, 0x08000001u /*       */, 0x0023u, {{0x0010u, (void *)&cy_ble_attValuesLen[15]}} },
    { 0x0022u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0023u, {{0x0010u, (void *)&cy_ble_attValuesLen[16]}} },
    { 0x0023u, 0x99AFu /* Distance                            */, 0x09020001u /* rd    */, 0x0023u, {{0x0001u, (void *)&cy_ble_attValuesLen[17]}} },
};

#endif /* (CY_BLE_GATT_ROLE_SERVER) */

/* Default device security */
#if (CY_BLE_MODE_PROFILE) 
    cy_stc_ble_gap_auth_info_t cy_ble_authInfo[0x01u] = {

    /* Security configuration 0 */
    {
        .security = (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1 ), 
        .bonding = CY_BLE_GAP_BONDING, 
        .ekeySize = 0x10u, 
        .authErr = CY_BLE_GAP_AUTH_ERROR_NONE, 
        .pairingProperties = 0x01u, 
    },
};

#endif /* CY_BLE_MODE_PROFILE */

/** Initialize BLE configuration parameters structure */
static const cy_stc_ble_params_t cy_ble_params =
{
        .txPowerLevelAdv                    = CY_BLE_LL_PWR_LVL_0_DBM,
        .txPowerLevelConn                   = CY_BLE_LL_PWR_LVL_0_DBM,

        .securityIoCapability               = CY_BLE_GAP_IOCAP_DISPLAY_ONLY,
        .securityPairingMethod              = 0x00u,
    
        .siliconDeviceAddressEnabled        = 0x01u,
    
        .gattDbIndexCount                   = 0x0023u,
};

cy_stc_ble_gap_bd_addr_t cy_ble_deviceAddress = {{0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 0x00u };

/**
* \addtogroup group_globals
* @{
*/
#endif /* CY_BLE_MODE_PROFILE */

/** The configuration structure for BLE */
cy_stc_ble_config_t cy_ble_config =
{
#if (CY_BLE_MODE_PROFILE)
    /* Initialize the GAPP structures */
    /* Initialize the cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo structure */
    #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
        .discoveryModeInfo = cy_ble_discoveryModeInfo,
        .gappAdvParams = cy_ble_gappAdvConfig,
    #else
        .discoveryModeInfo = NULL,
    #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */

    /* Initialize the cy_stc_ble_gapc_disc_info_t  cy_ble_discoveryInfo  structure */
    #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
        .discoveryInfo = cy_ble_discoveryInfo,
        .gapcScanParams = cy_ble_gapcScanConfig,
    #else
        .discoveryInfo = NULL,
    #endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

    /* Initialize the GATT structures */
    #if ((CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
        .flashStorage = &cy_ble_flashStorage,
    #else
        .flashStorage = NULL,
    #endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES */

    #if (CY_BLE_GATT_ROLE_SERVER)
        .gatts            = &cy_ble_gatts,
        .gaps             = &cy_ble_gaps,
        .attValuesCCCD    = cy_ble_attValuesCCCD,
        .gattDB           = cy_ble_gattDB,
    #else
        .gatts            = NULL,
        .attValuesCCCD    = NULL,
        .gattDB           = NULL,
    #endif /* CY_BLE_GATT_ROLE_SERVER */

    #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)
        /* Initialize the device security structure */
        .authInfo = cy_ble_authInfo,
    #else
        .authInfo = NULL,
    #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL */

    /* Initialize the BLE configuration parameters structure */
    .params   = &cy_ble_params,

    /* An application layer event callback function to receive service events from the BLE Component. */
    .callbackFunc   = NULL,
    
    .deviceAddress  = &cy_ble_deviceAddress,
#endif /* CY_BLE_MODE_PROFILE */

#if (CY_BLE_CONFIG_STACK_CONTR_CORE)
    /* The BLESS interrupt configuration */
    .blessIsrConfig = &BLE_bless_isr_cfg,
#endif /* CY_BLE_CONFIG_STACK_CONTR_CORE */
};

#endif /* CY_BLE_HOST_CONTR_CORE */ 

/** @} group_globals */

/* [] END OF FILE */
